INSERT INTO genre (name) 
VALUES('Rock'),
	('Pop'),
	('Rap'),
	('Shanson'),
	('Electro');

INSERT INTO artist (name) 
VALUES('Ария'),
	('Баста'),
	('Алсу'),
	('М. Круг'),
	('Prodigy'),
	('Шура'),
	('Metallica'),
	('Гуф');

INSERT INTO genre_to_artist 
VALUES(1, 1),
	(2, 2),
	(3, 2),
	(3, 3),
	(4, 4),
	(5, 5),
	(2, 6),
	(1, 7),
	(3, 8);

INSERT INTO album (name, year_of_release) 
VALUES('Игра с Огнем', 1989),
	('Ты была права', 2021),
	('Самое главное', 2008),
	('Владимирский Централ', 1999),
	('Music for the Jilted Generation', 1994),
	('Сердце бьется', 2012),
	('Death Magnetic', 2008),
	('Город дорог', 2007);

INSERT INTO album_to_artist 
VALUES(1, 1),
	(2, 2),
	(3, 3),
	(4, 4),
	(5, 5),
	(6, 6),
	(7, 7),
	(8, 8);

INSERT INTO track (name, album_id, duration) 
VALUES('Раскачаем этот мир', 1, '0:6:1'),
	('Игра с огнём', 1, '0:9:4'),
	('Бой продолжается', 1, '0:6:8'),
	('Ты была права', 2, '0:1:58'),
	('А у моей любви', 3, '0:3:40'),
	('Ты и Я', 3, '0:3:31'),
	('Водочку пьём', 4, '0:1:58'),
	('Владимирский централ', 4, '0:4:28'),
	('Voodoo People', 5, '0:6:27'),
	('Poison', 5, '0:6:42'),
	('Break & Enter', 5, '0:8:24'),
	('Сердце бьется', 6, '0:3:18'),
	('My Apocalypse', 7, '0:5:01'),
	('The Unforgiven III', 7, '0:7:46'),
	('That Was Just Your Life', 7, '0:7:08'),
	('Ямакаси', 8, '0:3:38'),
	('Сплетни', 8, '0:3:12');

INSERT INTO collection (name, year_of_release) 
VALUES('Сброник 1', 2015),
	('Сборник 2', 2016),
	('Сборник 3',2017),
	('Сборник 4',2018),
	('Сборник 5',2019),
	('Сборник 6',2020),
	('Сборник 7',2021),
	('Сборник 8',2022);

INSERT INTO track_to_collection
VALUES(1,1),(1,2),
	(2,4),(2,5),(2,6),
	(3,7),(3,8),
	(4,9),(4,10),
	(5,12),
	(6,13),(6,14),
	(7,15),
	(8,16),(8,17);